function[objective] = down_position_plus(x)

%% 功能：将1×33向量分解为3个独热向量 + 非零值列表
% 样本数N
N = 20;
objective = zeros(N,1);
% 建立10个样本
for i = 1:N
% ===== 1️⃣ 找出非零元素位置与数值 =====
idx = find(x(i,:) ~= 0);      % 非零元素索引
% vals = x(i,idx);           % 非零元素取值

% ===== 2️⃣ 构造3×33的独热矩阵 =====
% Lc_pes = zeros(length(idx), length(x(i,:)));
% for j = 1:length(idx)
%     Lc_pes(j, idx(j)) = 1;
% end

% ===== 3️⃣ 非零值向量 =====
% Ees_max = vals(:);   % 转为列向量 (3×1)

% ===== 4️⃣ 拆分为单独变量 =====
% % 独热矩阵逐行拆分
% Lc_pes1 = Lc_pes(1, :);
% Lc_pes2 = Lc_pes(2, :);
% Lc_pes3 = Lc_pes(3, :);
% 
% % 非零值逐个拆分
% Ees_max1 = Ees_max(1);
% Ees_max2 = Ees_max(2);
% Ees_max3 = Ees_max(3);

%% 同时考虑N-1 N-2 N-5场景时,一定要注意权重(N-5损失远大于N-1 N-2)
tic
%% BPSO综合情况 ob1 ob2 X
% 20-20的运行情况
% idx = [24 30 33];% 目标函数：0.6531 % 可靠性-断路数5 故障恢复率：0.9829 V_bias:0.0220 储能成本：0.4725/0.003
% Rload 0	0.999996410005198	0.999999817833221	0.999997555582952	0.999995342093133	0.999995975370509	0.999999989848274	0.999999940531396	0.888884216649954	0.888884201996790	0.888882354557767	0.999999719405276	0.999991734284808	1.00000009427555	0.888875025996116	0.999977937208774	0.996875826256587	1.00000013763435	0.999995847127769	0.999993651636891	0.999999817832268	0.999992050863749	0.906533826614207	0.999900210217959	1.00000001660630	0.999996114959446	0.999996311478786	0.889103607241990	0.999999861447054	0.999944946674550	0.999999980766367	0.888997067796281	0.999997268777934
idx = [18 24 31];% 目标函数：0.6533 % 可靠性-断路数4 故障恢复率：0.9828 V_bias:0.0217 储能成本：0.4725/0.003
% Rload 0	0.999985707375555	0.999999835401587	0.999995219384912	0.999994337261255	0.999996544089870	0.999999993132167	0.999999934605388	0.888885858652437	0.888886473370740	0.888885433186463	0.999999745554929	0.999997701802658	1.00000009836383	0.888886909275401	0.999998293322991	0.999998471010919	0.999999964896934	0.999985693693939	0.999994394149995	0.999999835439071	0.999996882330451	0.896526363684617	0.990330024347387	1.00000003039968	0.999996690457966	0.999996893898888	0.916244137414827	0.999999871557713	0.900984443184272	0.999999984411246	0.999983027724896	0.999997010638649

% 综合全部的指标，[18 24 31]略优于[24 30 33]


[f1,r_load1,V_bias1,R_load1] = function1_plus(idx);
[f2,r_load2,V_bias2,R_load2] = function2_plus(idx);
[f3,r_load3,V_bias3,R_load3] = function3_plus(idx);
[f4,r_load4,V_bias4,R_load4] = function4_plus(idx);
[f5,r_load5,V_bias5,R_load5] = function5_plus(idx);
[f6,r_load6,V_bias6,R_load6] = function6_plus(idx);
[f7,r_load7,V_bias7,R_load7] = function7_plus(idx);
[f8,r_load8,V_bias8,R_load8] = function8_plus(idx);
[f9,r_load9,V_bias9,R_load9] = function9_plus(idx);
toc

% 归一化的方法
Ees_cost = 105; % 电池配置价格 单位:万美元/10MWh 
w_ess = 0.003; % 储能成本权重-每年可能发生的 1-2 次 电网断电事故;储能预期使用年限：10 – 15 年

ob1 = 1/2*(f1+f2) + (0.8085*f3+0.0766*f4+0.1149*f5);
ob2 = 0.4520*f6+0.3310*f7+0.1600*f8+0.0570*f9;
X = w_ess*Ees_cost*1.5;
objective(i,:) = ob1 + ob2 + X;


% r_load = (r_load1+r_load2+r_load3+r_load4+r_load5)/5;
% V_bias = (V_bias1+V_bias2+V_bias3+V_bias4+V_bias5)/5;
% r_load = (r_load6+r_load7+r_load8+r_load9)/4;
% V_bias = (V_bias6+V_bias7+V_bias8+V_bias9)/4;

r_load = (r_load1+r_load2+r_load3+r_load4+r_load5+r_load6+r_load7+r_load8+r_load9)/9;
V_bias = (V_bias1+V_bias2+V_bias3+V_bias4+V_bias5+V_bias6+V_bias7+V_bias8+V_bias9)/9;
R_load = (R_load1+R_load2+R_load3+R_load4+R_load5+R_load6+R_load7+R_load8+R_load9)/9;
R_load = R_load';
V_bias = sum(V_bias)/4;
r_load = value(r_load);
V_bias = value(V_bias);
end




