function [C_res,pk] = datap
% 参考子论文:硕_东南大学_含高比例分布式光伏配电网的电压控制策略研究_吴振(拉丁超立方采样)

% 光伏场景生成与聚类
% pv超立方抽样+k-means聚类
alfa=2.5;bata=0.5;%光伏参数
ns=1000;%模拟数量
for i=1:24 % 猜想:1列填入1000个样本
    y(:,i)=betaLHS(ns,alfa,bata); % 光伏出力概率函数为beta分布
end

% 将三个节点总出力变为单个节点出力,同时要考虑标幺值以及与论文实例的比例换算,暂定为乘500
% pv = 50.*[0 0 0 0 0 0.185 0.195 0.3 0.48 0.63 0.7 0.76 0.83 0.76 0.7 0.63 0.48 0.3 0 0 0 0 0 0]; % 直接把单位变为kW
% pv=50.*[0,0,0,0,0,0.00670613838163443,0.0740392771149517,0.240411546113239,0.450742969667699,0.699735172142443,0.855341269188865,0.963572441035704,1,0.917690448475439,0.500560277957363,0.463527102400363,0.341920844346065,0.191942376214751,0.136370650849977,0,0,0,0,0];
% 取IEEE38的数据
pv = [0 0 0 0 0 0.185 0.195 0.3 0.48 0.63 0.7 0.76 0.83 0.76 0.7 0.63 0.48 0.3 0 0 0 0 0 0 ]; % 已经是标幺值

pv_lhs = repmat(pv,ns,1).*(1+0.2.*(y-0.5)); % repmat(pv,ns,1):把pv扩展为1000*24大小;(y-0.5):对服从特定分布的随机误差 yw 进行中心化调整
% 1+0.2.*(y-0.5):1 是原本的出力值;y-0.5:偏差值中心化;0.2:相乘的系数
data=pv_lhs;K=5;
[Cv,kv]=kmeans(data,K);


%风电场景生成与聚类
%pw超立方抽样+k-means聚类
% 论文中给出的是韦伯分布
lamda=10;k=2;
for i=1:24
    yw(:,i)=wblLHS(ns,lamda,k);
end

% 将三个节点总出力变为单个节点出力,同时要考虑标幺值以及与论文实例的比例换算
% pw = 50.*[1.4 1.53 1.45 1.34 1.26 1.13 1.03 0.75 0.55 0.35 0.45 0.43 0.35 0.32 0.30 0.33 0.35 0.43 0.55 0.72 0.75 0.79 0.82 0.95];% 直接把单位也变为kW
% pw=50.*[0.359165	0.378539	0.397914	0.546945	0.518629	0.497765	0.459016	0.318927	0.253353	0.4307	0.490313	0.561848	0.582712	0.603577	0.643815	0.663189	0.718331	0.631893	0.530551	0.460507	0.38152	0.371088	0.359165	0.338301];
% 取IEEE38的数据
pw = [1.4 1.53 1.45 1.34 1.26 1.13 1.03 0.75 0.55 0.35 0.45 0.43 0.35 0.32 0.30 0.33 0.35 0.43 0.55 0.72 0.75 0.79 0.82 0.95]; % 已经是标幺值
pw_lhs=repmat(pw,ns,1).*(1+0.3.*(yw-0.5));
data=pw_lhs;K=5;
[Cw,kw]=kmeans(data,K);

% 以往论文中出现过这个思路:把这些不确定性变量生成的场景数都乘起来,得到场景总数
% 生成场景总数
kt=0;
for k1=1:5
    for k2=1:5
            kt=kt+1;
            C_res(kt,:)=[Cv(k1,:) Cw(k2,:)];
            pk(kt)=kv(k1)*kw(k2);  % 光伏k1场景;风电k2场景的样本占比
    end
end

end

