function [C_res,pk] = datap
% 参考子论文:硕_东南大学_含高比例分布式光伏配电网的电压控制策略研究_吴振(拉丁超立方采样)

% 光伏场景生成与聚类
% pv超立方抽样+k-means聚类
alfa=2.5;bata=0.5;%光伏参数
ns=1000;%模拟数量
for i=1:24 % 猜想:1列填入1000个样本
    y(:,i)=betaLHS(ns,alfa,bata); % 光伏出力概率函数为beta分布
end
% 应该是出力数据
pv=50.*[0 0 0 0 0 0.185 0.195 0.3 0.48 0.63 0.7 0.76 0.83 0.76 0.7 0.63 0.48 0.3 0 0 0 0 0 0];
pv_lhs=repmat(pv,ns,1).*(1+0.2.*(y-0.5)); % repmat(pv,ns,1):把pv扩展为1000*24大小;(y-0.5):对服从特定分布的随机误差 yw 进行中心化调整
% 1+0.2.*(y-0.5):1 是原本的出力值;y-0.5:偏差值中心化;0.2:相乘的系数
data=pv_lhs;K=5;
[Cv,kv]=kmeans(data,K);


%风电场景生成与聚类
%pw超立方抽样+k-means聚类
% 论文中给出的是韦伯分布
lamda=10;k=2;
for i=1:24
yw(:,i)=wblLHS(ns,lamda,k);
end
pw=50.*[1.4 1.53 1.45 1.34 1.26 1.13 1.03 0.75 0.55 0.35 0.45 0.43 0.35 0.32 0.30 0.33 0.35 0.43 0.55 0.72 0.75 0.79 0.82 0.95];
pw_lhs=repmat(pw,ns,1).*(1+0.3.*(yw-0.5));
data=pw_lhs;K=5;
[Cw,kw]=kmeans(data,K);

% 以往论文中出现过这个思路:把这些不确定性变量生成的场景数都乘起来,得到场景总数
% 生成场景总数
kt=0;
for k1=1:5
    for k2=1:5
                kt=kt+1;
                C_res(kt,:)=[Cv(k1,:) Cw(k2,:)];
                pk(kt)=kv(k1)*kw(k2);  % 光伏k1场景;风电k2场景的样本占比
    end
end

end

